// パッケージの宣言
package Ensyu7_5;

/*
 * クラス名：Ensyu7_5
 * 概要：演習7-5クラス
 * 作成者：S.Saito
 * 作成日：2023.04.19
 */
public class Ensyu7_5 {
	
	/*
	 * 関数名：hello
	 * 概要：「こんにちは。」と表示して改行する。関数名は指定のものを使う。
	 * 引数：なし
	 * 戻り値：なし
	 * 作成者：S.Saito
	 * 作成日：2023.04.19
	 */
	static void hello() {
		// 「こんにちは。」と表示して改行する
		System.out.println("こんにちは。");
	}
	
	/*
	 * 関数名：main
	 * 概要：「こんにちは。」と表示して改行するメソッドの動作を確認する。
	 * 引数：なし
	 * 戻り値：なし
	 * 作成者：S.Saito
	 * 作成日：2023.04.19
	 */
	public static void main(String[] args){
		// 「こんにちは。」の表示と改行が行われることを確認する
		hello();
	}

}
